mentatpsi/Microchip/USB/Device - Bootloaders/HID/Firmware - PIC18F46J50 Family/Boot46J50Family.c
/** P R I V A T E  P R O T O T Y P E S ***************************************/
void WriteFlashSubBlock(void);
void UnlockAndActivate(unsigned char UnlockKey);
void ResetDeviceCleanly(void);
void TableReadPostIncrement(void);
void SignFlash(void);
void EraseFlashPage(unsigned char PageNumToErase);
void LowVoltageCheck(void);


/** D E C L A R A T I O N S **************************************************/
#pragma code
void UserInit(void)
{
	//Initialize bootloader state variables
	MaxPageToErase = MaxPageToEraseNoConfigs;		//Assume we will not allow erase/programming of config words (unless host sends override command)
	ProgramMemStopAddress = ProgramMemStopNoConfigs;
	BootState = IDLE;
	ProgrammedPointer = INVALID_ADDRESS;	
	BufferedDataIndex = 0;
	ConfigsLockValue = TRUE;
}//end UserInit


/******************************************************************************
 * Function:        void ProcessIO(void)
 *
 * PreCondition:    None
 *
 * Input:           None
 *
 * Output:          None
 *
 * Side Effects:    None
 *
 * Overview:        This function receives/sends USB packets to/from the USB 
 *                  host.  It also processes any received OUT packets and
 *                  is reponsible for generating USB IN packet data.
 *
 * Note:            None
 *****************************************************************************/
void ProcessIO(void)
{
	static unsigned char i;

    //Check if we are busy processing a command yet or not.
	if(BootState == IDLE)
	{
    	//We are currently in the IDLE state waiting for a command from the
    	//PC software on the USB host.
		if(!mHIDRxIsBusy())	//Did we receive a command?
		{
    		//We received a new command from the host.  Copy the OUT packet from 
    		//the host into a local buffer for processing.
			HIDRxReport((char *)&PacketFromPC, USB_PACKET_SIZE);     //Also re-arms the OUT endpoint to be able to receive the next packet
			BootState = NOT_IDLE;   //Set flag letting state machine know it has a command that needs processing.
			
			//Pre-initialize a response packet buffer (only used for some commands)
			for(i = 0; i < USB_PACKET_SIZE; i++)		//Prepare the next packet we will send to the host, by initializing the entire packet to 0x00.
				PacketToPC.Contents[i] = 0;				//This saves code space, since we don't have to do it independently in the QUERY_DEVICE and GET_DATA cases.
		}
	}
	else //(BootState must be NOT_IDLE)
	{	
    	//Check the latest command we received from the PC app, to determine what
    	//we should be doing.
		switch(PacketFromPC.Command)
		{
			case QUERY_DEVICE:
				//Prepare a response packet, which lets the PC software know about the memory ranges of this device.
				PacketToPC.Command = QUERY_DEVICE;
				PacketToPC.PacketDataFieldSize = REQUEST_DATA_BLOCK_SIZE;
				PacketToPC.BytesPerAddress = BYTES_PER_ADDRESS_PIC18;
				PacketToPC.Type1 = MEMORY_REGION_PROGRAM_MEM;
				PacketToPC.Address1 = (unsigned long)PROGRAM_MEM_START_ADDRESS;
				PacketToPC.Length1 = (unsigned long)(ProgramMemStopAddress - PROGRAM_MEM_START_ADDRESS);	//Size of program memory area
				PacketToPC.Type2 = MEMORY_REGION_CONFIG;
				PacketToPC.Address2 = (unsigned long)CONFIG_WORDS_START_ADDRESS;
				PacketToPC.Length2 = (unsigned long)CONFIG_WORDS_SECTION_LENGTH;
				PacketToPC.Type3 = MEMORY_REGION_END;		
				PacketToPC.VersionFlag = BOOTLOADER_V1_01_OR_NEWER_FLAG;
				//Init pad bytes to 0x00...  Already done after we received the QUERY_DEVICE command (just after calling HIDRxReport()).
	
	            //Now send the packet to the USB host software, assuming the USB endpoint is available/ready to accept new data.
				if(!mHIDTxIsBusy())
				{
					HIDTxReport((char *)&PacketToPC, USB_PACKET_SIZE);
					BootState = IDLE;
				}
				break;
			case UNLOCK_CONFIG:
				ConfigsLockValue = TRUE;
				if(PacketFromPC.LockValue == UNLOCKCONFIG)
				{
					ConfigsLockValue = FALSE;
					MaxPageToErase = MaxPageToEraseWithConfigs;		//Assume we will not allow erase/programming of config words (unless host sends override command)
					ProgramMemStopAddress = ProgramMemStopWithConfigs;
				}
				else	//LockValue must be == LOCKCONFIG
				{
					MaxPageToErase = MaxPageToEraseNoConfigs;		
					ProgramMemStopAddress = ProgramMemStopNoConfigs;
				}
				BootState = IDLE;
				break;
			case ERASE_DEVICE:
				//Erase all pages of the program flash memory, that are in the
				//application space (although could be one less, if config word
				//programming is not allowed, since we don't want to erase the
				//config bits in this case, which are on the last flash erase page.)
				for(i = StartPageToErase; i < (MaxPageToErase + 1); i++)
				{
					ClearWatchdog();
					EraseFlashPage(i);
					USBDriverService(); 	//Call USBDriverService() periodically to prevent falling off the bus if any SETUP packets should happen to arrive.
				}
				BootState = IDLE;				
				break;
			case PROGRAM_DEVICE:
				if(ProgrammedPointer == (unsigned short long)INVALID_ADDRESS)
					ProgrammedPointer = PacketFromPC.Address;
				
				if(ProgrammedPointer == (unsigned short long)PacketFromPC.Address)
				{
					for(i = 0; i < PacketFromPC.Size; i++)
					{
						ProgrammingBuffer[BufferedDataIndex] = PacketFromPC.Data[i+(REQUEST_DATA_BLOCK_SIZE-PacketFromPC.Size)];	//Data field is right justified.  Need to put it in the buffer left justified.
						BufferedDataIndex++;
						ProgrammedPointer++;
						if(BufferedDataIndex == REQUEST_DATA_BLOCK_SIZE)
						{
							WriteFlashSubBlock();
						}
					}
				}
				//else host sent us a non-contiguous packet address...  to make 
				//this firmware simpler, host should not do this without sending 
				//a PROGRAM_COMPLETE command in between program sections.
				BootState = IDLE;
				break;
			case PROGRAM_COMPLETE:
				WriteFlashSubBlock();
				ProgrammedPointer = INVALID_ADDRESS;		//Reinitialize pointer to an invalid range, so we know the next PROGRAM_DEVICE will be the start address of a contiguous section.
				BootState = IDLE;
				break;
			case GET_DATA:
				//Init pad bytes to 0x00...  Already done after we received the QUERY_DEVICE command (just after calling HIDRxReport()).
				PacketToPC.Command = GET_DATA;
				PacketToPC.Address = PacketFromPC.Address;
				PacketToPC.Size = PacketFromPC.Size;

				TBLPTR = (unsigned short long)PacketFromPC.Address;
				for(i = 0; i < PacketFromPC.Size; i++)
				{
					TableReadPostIncrement();
                    PacketToPC.Data[i+((USB_PACKET_SIZE - 6) - PacketFromPC.Size)] = TABLAT;
				}

				//Assuming the USB IN (to host) buffer is available/ready, copy the
				//data over so it can get sent to the USB host software.
				if(!mHIDTxIsBusy())
				{
					HIDTxReport((char *)&PacketToPC, USB_PACKET_SIZE);
					BootState = IDLE;
				}
				break;
			case SIGN_FLASH:
			    SignFlash();
			    BootState = IDLE;
			    break;
			case QUERY_EXTENDED_INFO:
			    //Prepare a response packet with the QUERY_EXTENDED_INFO response info in it.
			    //This command is only supported in bootloader firmware verison 1.01 or later.
			    //Make sure the regular QUERY_DEVIER reponse packet value "PacketToPC.Type6" is = BOOTLOADER_V1_01_OR_NEWER_FLAG;
			    //to let the host PC software know that the QUERY_EXTENDED_INFO command is implemented
			    //in this firmware and is available for requesting by the host software.
			    PacketToPC.Command = QUERY_EXTENDED_INFO;   //Echo the command byte
			    PacketToPC.BootloaderVersion = ((unsigned int)BOOTLOADER_VERSION_MAJOR << 8)| BOOTLOADER_VERSION_MINOR;
			    PacketToPC.ApplicationVersion = *(rom unsigned int*)APP_VERSION_ADDRESS;
			    PacketToPC.SignatureAddress = APP_SIGNATURE_ADDRESS;
			    PacketToPC.SignatureValue = APP_SIGNATURE_VALUE;
			    PacketToPC.ErasePageSize = ERASE_PAGE_SIZE;
			    PacketToPC.Config1LMask = 0xFF;
			    PacketToPC.Config1HMask = 0xFF;
			    PacketToPC.Config2LMask = 0xFF;
			    PacketToPC.Config2HMask = 0xFF;
			    PacketToPC.Config3LMask = 0xFF;
			    PacketToPC.Config3HMask = 0xFF;
			    PacketToPC.Config4LMask = 0xFF;
			    PacketToPC.Config4HMask = 0xFF;
			    PacketToPC.Config5LMask = 0x00;
			    PacketToPC.Config5HMask = 0x00;
			    PacketToPC.Config6LMask = 0x00;
			    PacketToPC.Config6HMask = 0x00;
			    PacketToPC.Config7LMask = 0x00;
			    PacketToPC.Config7HMask = 0x00;
			    
			    //Now actually command USB to send the packet to the host    			    
			    if(!mHIDTxIsBusy())
			    {
					HIDTxReport((char *)&PacketToPC, USB_PACKET_SIZE);
    			    BootState = IDLE;   //Packet will be sent, go back to idle state ready for next command from host
		        }	    
			    break;
			case RESET_DEVICE:
			    ResetDeviceCleanly();
			    //break;    //no need, commented to save space
			default:
			    //Should never hit the default
			    BootState = IDLE;
		}//End switch
	}//End if/else

}//End ProcessIO()



//Should be called once, only after the regular erase/program/verify sequence 
//has completed successfully.  This function will program the magic
//APP_SIGNATURE_VALUE into the magic APP_SIGNATURE_ADDRESS in the application
//flash memory space.  This is used on the next bootup to know that the the
//flash memory image of the application is intact, and can be executed.
//This is useful for recovery purposes, in the event that an unexpected
//failure occurs during the erase/program sequence (ex: power loss or user
//unplugging the USB cable).
void SignFlash(void)
{
    static unsigned int i;
    
